design_model/src/main/resources/行为型模式/解释器模式/解释器模式.md
```mermaid
classDiagram
    class AbstractExpression ["AbstractExpression(抽象表达式)"]{
        <<Abstract>>
        +interpret(Context ctx)*
    }
    class TerminalExpression ["TerminalExpression(终结符表达式)"]{
        +interpret(Context ctx);
    }
    class NonterminalExpression ["NonterminalExpression(非终结符表达式)"]{
        +interpret(Context ctx);
    }
    class Context ["Context(环境类)"]{
    }
    TerminalExpression --|> AbstractExpression
    NonterminalExpression --|> AbstractExpression
    NonterminalExpression o-- AbstractExpression
    AbstractExpression ..> Context
    Client ..> Context
    Client ..> AbstractExpression
```
